Console.Write("Введите значение ");
string messege = Console.ReadLine();
char firstmas = messege[2];
Console.WriteLine(firstmas);
Console.WriteLine("нет третьего");





//if s = s.Length.ToString (s[2])
//{
 //   Console.WriteLine(s);
//}
//else
//{
  //  Console.WriteLine("Третьего символа нет");
//}


//Задача 13: Напишите программу, которая выводит третью цифру заданного числа или сообщает, что третьей цифры нет.
//645 -> 5
//78 -> третьей цифры нет
//32679 -> 6
